####  Сегментация
####  Запретите сброс пароля (no service password-recovery) 
на коммутаторах уровня доступа к которым возможен физический доступ
####  Не используйте Telnet 
в качестве протокола удаленного подключения. Используйте защищенные протоколы удаленного подключения ([[SSH - Router Switches]]).

####  Настройте вход ACL
[[ACL#Защита портов VTY]]

####  Отключите неиспользуемые сервисы. Определите какие сервисы Вам не нужны
```
no service tcp-small-servers echo
no service tcp-small-servers discard
no service tcp-small-servers daytime
no service tcp-small-servers chargen
no service udp-small-servers echo
no service udp-small-servers discard
no service udp-small-servers daytime
no service udp-small-servers chargen
no ip finger
no ip bootp server
no ip dhcp boot ignore
no service dhcp
no mop enabled
no ip domain-lookup
no service pad
no ip http server
no ip http secure-server
no service config
no cdp enable
no cdp run
no lldp transmit
no lldp receive
no lldp run global
```

#### Отключайте неиспользуемые порты, либо переводите их в неиспользуемый VLAN + Не используйте VLAN 1.
```
Switch(config)#interface range fa0/21 - 24
Switch(config-if)#shutdown
ИЛИ 
Switch(config-if)#switchport access vlan 2
```

#### Port Security
```
show mac address-table
# Port Security на конретном интерфейсе
Switch(config)#int f0/1
Switch(config-if)#sw access vlan 2
Switch(config-if)#sw mode access
Switch(config-if)#sw port-security
Switch(config-if)#sw port-security max 2
Switch(config-if)#sw port-security violation {shutdown|restrict|protect}
Switch(config-if)#sw port-security mac-address 0004.9AA7.8B7C
Switch(config-if)#sw port-security mac-address sticky > закрепляет текущий MAC
```
#### DHCP Snooping
Атакующий может поднять собственный DHCP, который в ответ на запрос клиентского устройства будет отдавать в качестве шлюза по умолчанию (а также, например, DNS-сервера).
```
Switch(config)# ip dhcp snooping # enable DHCP snooping globally
Switch(config)# ip dhcp snooping vlan number {number} # enable DHCP snooping on the specified VLAN
Switch(config-if)# ip dhcp snooping trust # configure the interface as a trusted interface
Switch(config-if)# ip dhcp snooping limit rate {rate} #limit the number of DHCP packets that the interface can receive in a second.|
ПРОВЕРКА
Switch# show ip dhcp snooping
Switch# debug ip dhcp snooping event
Switch# debug ip dhcp snooping packet
```
При включенномDHCP Snooping можно включить IP Source Guard, которая проверяет соответствие IP-адреса источника адресу, полученному из базы DHCP Snooping и соответствие MAC-адреса источника адресу, полученному из базы DHCP Snooping.

#### ARP Inspection
```
Step 1. Verify the connection between switches S1 and S2
S1# show cdp neighbors
	S2 Fas 6/3 177 R S I WS-C4006 Fas 3/3
	
Step 2 Enable DAI on VLAN 1 and verify the configuration
S1(config)# ip arp inspection vlan 1
S1# show ip arp inspection vlan 1
	Source Mac Validation : Disabled
	Destination Mac Validation : Disabled
	IP Address Validation : Disabled
	Vlan Configuration Operation ACL Match Static ACL
	---- ------------- --------- --------- ----------
	1    Enabled       Active
	Vlan ACL Logging DHCP Logging
	---- ----------- ------------
	1   Deny Deny

Step 3 Configure interface fa6/3 as trusted
S1(config)# in fa6/3
S1(config-if)# ip arp inspection trust
S1# show ip arp inspection interfaces fastEthernet 6/3
Interface Trust State Rate (pps)
--------------- ----------- ----------
Fa6/3    Trusted None

Step 5 Check the statistics before and after Dynamic ARP processes any packets:
S1# show ip arp inspection statistics vlan 1
```